Revit 2027 API
GroupTypeId.MechanicalLoads Property
 Mechanical - Loads.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MechanicalLoads { get; }
Public Shared ReadOnly Property MechanicalLoads As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MechanicalLoads {
	ForgeTypeId^ get ();
}
static member MechanicalLoads : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace